# DefaultPathOfTravelCalculationGUID Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PathOfTravelCalculationServerIds..::..DefaultPathOfTravelCalculationGUID Property
PathOfTravelCalculationServerIds Class See Also
---
GUID to represent the default calculation server id.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public static Guid DefaultPathOfTravelCalculationGUID { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DefaultPathOfTravelCalculationGUID As Guid
	Get
```

Visual C++
---
```text
public:
static property Guid DefaultPathOfTravelCalculationGUID {
	Guid get ();
}
```

# See Also
PathOfTravelCalculationServerIds Class
Autodesk.Revit.DB.Analysis Namespace